In [1]:
import pandas as pd

In [2]:
train = pd.read_csv(r"C:\Users\gaume\Documents\kaggle\Titanic\data\train.csv")

In [3]:
test = pd.read_csv(r"C:\Users\gaume\Documents\kaggle\Titanic\data\test.csv")

In [4]:
gender_submission = pd.read_csv(r"C:\Users\gaume\Documents\kaggle\Titanic\data\gender_submission.csv")

In [5]:
# gender_submission

In [6]:
# train

In [7]:
# test

In [8]:
# lower case column names
train.columns = train.columns.str.lower()
test.columns = test.columns.str.lower()

In [37]:
# train

In [10]:
train[["fist_name", "rest_name"]] = train.name.str.split(",", expand = True)

In [11]:
train[["title", "last_name", "other"]]=train["rest_name"].str.split(".", expand = True)

In [38]:
# train[["title", "last_name", "other"]]

In [39]:
# train[["fist_name", "title", "last_name", "other"]]

In [51]:
# look at the servival rate for each gender
train.groupby("sex")["survived"].describe()

        count      mean       std  min  25%  50%  75%  max
sex
female  314.0  0.742038  0.438211  0.0  0.0  1.0  1.0  1.0
male    577.0  0.188908  0.391775  0.0  0.0  0.0  0.0  1.0

In [14]:
# strip spaces from title
train["title"] = train["title"].str.strip()

In [15]:
train["title"].value_counts()

Mr              517
Miss            182
Mrs             125
Master           40
Dr                7
Rev               6
Col               2
Major             2
Mlle              2
Mme               1
Jonkheer          1
the Countess      1
Ms                1
Capt              1
Sir               1
Lady              1
Don               1
Name: title, dtype: int64

In [45]:
train["title"] = train["title"].replace(["Dr", "Rev", "Major", "Mlle", "Col", "Capt", "Mme", "Sir", "Ms", "Jonkheer", "the Countess", "Don", "Lady"],"other")#.value_counts()

In [47]:
# look at the servival rate for each title
train.groupby("title")["survived"].describe()

        count      mean       std  min  25%  50%  75%  max
title
Master   40.0  0.575000  0.500641  0.0  0.0  1.0  1.0  1.0
Miss    182.0  0.697802  0.460477  0.0  0.0  1.0  1.0  1.0
Mr      517.0  0.156673  0.363844  0.0  0.0  0.0  0.0  1.0
Mrs     125.0  0.792000  0.407510  0.0  1.0  1.0  1.0  1.0
other    27.0  0.444444  0.506370  0.0  0.0  0.0  1.0  1.0

In [18]:
train["age_group"] = pd.cut(x=train["age"], bins = [0,18,30,40,50,65,120])

In [19]:
train["age_group"].value_counts()

(18, 30]     270
(30, 40]     155
(0, 18]      139
(40, 50]      86
(50, 65]      56
(65, 120]      8
Name: age_group, dtype: int64

In [57]:
train["age_group_number"] = train["age_group"].apply(lambda x: str(x)).replace(["(0, 18]", "(18, 30]", "(30, 40]", "(40, 50]", "(50, 65]", "(65, 120]"],[9, 24, 35, 45, 58, 73])# value_counts()

In [58]:
train["age_group_str"] = train["age_group"].apply(lambda x: str(x)).replace(["(0, 18]", "(18, 30]", "(30, 40]", "(40, 50]", "(50, 65]", "(65, 120]"],["0-18", "18-30", "30-40", "40-50", "50-65", "65-80"])# value_counts()

In [60]:
# look at the servival rate for each age groupb
train.groupby("age_group_str")["survived"].describe()

               count      mean       std  min  25%  50%  75%  max
age_group_str
0-18           139.0  0.503597  0.501795  0.0  0.0  1.0  1.0  1.0
18-30          270.0  0.355556  0.479570  0.0  0.0  0.0  1.0  1.0
30-40          155.0  0.445161  0.498595  0.0  0.0  0.0  1.0  1.0
40-50           86.0  0.383721  0.489143  0.0  0.0  0.0  1.0  1.0
50-65           56.0  0.375000  0.488504  0.0  0.0  0.0  1.0  1.0
65-80            8.0  0.125000  0.353553  0.0  0.0  0.0  0.0  1.0

In [25]:
train["sibsp"].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: sibsp, dtype: int64

In [26]:
train["cabin"].describe()

count             204
unique            147
top       C23 C25 C27
freq                4
Name: cabin, dtype: object

In [27]:
train["cabin_first_letter"] = train["cabin"].apply(lambda x: x if pd.isna(x) else x[:1])

In [28]:
train["cabin_first_letter"].value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
T     1
Name: cabin_first_letter, dtype: int64

In [63]:
# look at the servival rate for each cabin
train.groupby("cabin_first_letter")["survived"].describe()

                    count      mean       std  min   25%  50%  75%  max
cabin_first_letter
A                    15.0  0.466667  0.516398  0.0  0.00  0.0  1.0  1.0
B                    47.0  0.744681  0.440755  0.0  0.50  1.0  1.0  1.0
C                    59.0  0.593220  0.495450  0.0  0.00  1.0  1.0  1.0
D                    33.0  0.757576  0.435194  0.0  1.00  1.0  1.0  1.0
E                    32.0  0.750000  0.439941  0.0  0.75  1.0  1.0  1.0
F                    13.0  0.615385  0.506370  0.0  0.00  1.0  1.0  1.0
G                     4.0  0.500000  0.577350  0.0  0.00  0.5  1.0  1.0
T                     1.0  0.000000       NaN  0.0  0.00  0.0  0.0  0.0

In [29]:
train.columns

Index(['passengerid', 'survived', 'pclass', 'name', 'sex', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked', 'fist_name',
       'rest_name', 'title', 'last_name', 'other', 'age_group',
       'age_group_number', 'age_group_str', 'cabin_first_letter'],
      dtype='object')

In [30]:
train.isna().sum()

passengerid             0
survived                0
pclass                  0
name                    0
sex                     0
age                   177
sibsp                   0
parch                   0
ticket                  0
fare                    0
cabin                 687
embarked                2
fist_name               0
rest_name               0
title                   0
last_name               0
other                 890
age_group             177
age_group_number      885
age_group_str         891
cabin_first_letter    687
dtype: int64

In [31]:
train.groupby("title")["age"].mean()

title
Capt            70.000000
Col             58.000000
Don             40.000000
Dr              42.000000
Jonkheer        38.000000
Lady            48.000000
Major           48.500000
Master           4.574167
Miss            21.773973
Mlle            24.000000
Mme             24.000000
Mr              32.368090
Mrs             35.898148
Ms              28.000000
Rev             43.166667
Sir             49.000000
the Countess    33.000000
Name: age, dtype: float64

In [32]:
train["age"].fillna(value = train["age"].mean(), inplace = True)

In [33]:
train["age"].mean()

29.699117647058763

In [34]:
train.isna().sum()

passengerid             0
survived                0
pclass                  0
name                    0
sex                     0
age                     0
sibsp                   0
parch                   0
ticket                  0
fare                    0
cabin                 687
embarked                2
fist_name               0
rest_name               0
title                   0
last_name               0
other                 890
age_group             177
age_group_number      885
age_group_str         891
cabin_first_letter    687
dtype: int64

In [35]:
train["cabin_first_letter"].value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
T     1
Name: cabin_first_letter, dtype: int64

In [36]:
len(train)

891